[
  {
    "name": "SDE Inter - EduFuse pvt ltd.",
    "description1": "During my software developer internship at EduFuse Private LTD, I had the opportunity to work with the MERN stack, along with MUI and AWS. My main responsibility was to develop a dashboard for teachers and students of IIT-Patna, which was currently expanding its domain.During my internship.I was able to create over 50 APIs and develop 20 fully responsive pages for the dashboard. It was a challenging task, but I was excited to learn and grow my skills. I had to work closely with the development team and other stakeholders to ensure that the dashboard met the requirements of the teachers and students.Working with the MERN stack was a great experience, and I was able to enhance my skills in ReactJS, NodeJS, and MongoDB. I also had the opportunity to work with MUI and AWS, which helped me gain valuable experience in front-end design and cloud computing.",
    "description2": "",
    "codeLink": "",
    "demoLink": "",
    "imageLink": "work.gif"
  },
  {
    "name": "SIH(2022)- Winner",
    "description1": " I am thrilled to have won SIH 2022 for my project, PENCIL. PENCIL is a platform that aims to eradicate child labour by providing educational and employment opportunities for children. The platform was developed using the MERN stack, which allowed for seamless integration and a smooth user experience. With PENCIL, we hope to make a positive impact on the lives of children by giving them the tools and resources they need to break free from the cycle of poverty and exploitation. I am grateful for the opportunity to showcase my skills and contribute to a worthy cause, and I look forward to continuing my work in the field of software development.",
    "description2": "",
    "codeLink": "",
    "demoLink": "",
    "imageLink": "work.gif"
  },
  {
    "name": "WEB intern-Auttaya Fashion And Technology Pvt LTD.",
    "description1": "During my internship at Auttaya Fashion and Technology Pvt Ltd, I had the opportunity to work as a web development intern. My main responsibility was to use ReactJS to develop the front-end of the company's website. It was a challenging task, but I was excited to learn and grow my skills.",
    "description2": "One of my notable achievements during my internship was converting the company's existing Redux project to a Redux Toolkit project. It required a strong understanding of both Redux and Redux Toolkit, but I was determined to make it happen. It was a great learning experience, and I was proud of what I was able to accomplish.",
    "codeLink": "",
    "demoLink": "",
    "imageLink": "work.gif"
  }
]
